[GraphicalObject]
Name=Ai_test
Path=
Caption=オートメーション インターフェース テスト
PosStyle=DIALOGBOX
WndStyle= BORDER|CAPTION
x=150
y=150
width=410
height=275
Color=192,192,192


[ToolDescriptor]
1=InsertPl, PushButton,hpgbut02.dll
2=EjectPl, PushButton,hpgbut02.dll
3=OpenDoor, PushButton,hpgbut02.dll
4=CloseDoor, PushButton,hpgbut02.dll
5=Read_Barcode, PushButton,hpgbut02.dll
6=Switch_Barcode, PushButton,hpgbut02.dll
7=BarcodeStr, STATIC,hpgwct02.dll
8=Close1, PushButton,hpgbut02.dll
9=Reset, PushButton,hpgbut02.dll
10=ActualView,STATIC,hpgwct02.dll
11=ActBarcode,DIALOGEDIT,hpgwct02.dll
12=gpControls,GROUPFRAME,hpgbut02.dll
13=gpBarcode,GROUPFRAME, hpgbut02.dll
14=AITest,statuslist,hpgwct02.dll


[statuslist AITest]
enable=1
x=210
y=40
width=210
height=150
bkcolor=gray
frame=1
Help=スタックのステータスを表示します
RcDll=hpsam008.dll
RcDll1=hpsam008.dll

Symbols1=Image1

Image1 = RBMP.AI_Test



[PUSHBUTTON InsertPl]
x=30
y=20
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_InsertPl
ImageList=プレート移動|プレート移動|プレート移動

[PUSHBUTTON EjectPl]
x=30
y=45
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_EjectPl
ImageList=リジェクト プレート|リジェクト プレート|リジェクト プレート

[PUSHBUTTON OpenDoor]
x=30
y=70
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_OpenDoor
ImageList=オープン サイドドア|オープン サイドドア|オープン サイドドア

[PUSHBUTTON CloseDoor]
x=30
y=95
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_CloseDoor
ImageList=クローズ サイドドア|クローズ サイドドア|クローズ サイドドア

[PUSHBUTTON Read_Barcode]
x=30
y=150
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_TestBarcode
ImageList=テスト バーコードリーダ|テスト バーコードリーダ|テスト バーコードリーダ


[PUSHBUTTON Switch_Barcode]
x=30
y=205
width=130
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_SwitchBarcode
ImageList=バーコード校正|バーコード校正|バーコード校正



[PUSHBUTTON Reset]
x=200
y=225
width=90
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_ResetAI
ImageList=リセット|リセット|リセット

[PUSHBUTTON close1]
x=300
y=225
width=90
height=22
State=0
BKColor=192,192,192
Enable=1
FrameThickness=1
Command=DG_CloseAITest
ImageList=閉じる|閉じる|閉じる

[STATIC ActualView]
x=215
y=10
width=160
height=22
shifty=2
Text1="アクションなし"
Justify=centered
BKColor=green
Enable=1
Frame=1
FrameThickness=1
Dimage=4


[STATIC BarcodeStr]
x=20
y=180
width=50
height=22
justify=left
Text1="バーコード:"
Dimage=1
Command=Select 1

[DIALOGEDIT ActBarcode]
x=80
y=180
width=100
height=18
Justify=right
Enable=1
Font=ＭＳ Ｐゴシック,9,normal
RcDLL=dgCursor.dll
CURSOR=editCur
Text=""

[GROUPFRAME gpControls]
x=10
y=9
width=180
height=119
FrameThickness=1


[GROUPFRAME gpBarcode]
x=10
y=140
width=180
height=95
FrameThickness=1



[ColorAlias]
1=green    |0,255,0
2=white    |255,255,255
3=black    |0,0,0
4=gray     |102,192,192
